app/Helpers/app-sip_helper.php

SELECT *
FROM `tbl_pegawai`
WHERE `tbl_pegawai`.`jabatan_kode` = '3407'
---
function getDetailFormasiManuk($jabatan_kode,$instansi_uker)
{
    $db      = \Config\Database::connect();
    $query =  $db->table('tbl_formasi')
        ->select('tbl_formasi.instansi_id,tbl_formasi.instansi_unor,tbl_formasi.jabatan_kode,formasi_jumlah,tbl_jabatan.jabatan_nama,tbl_unor.instansi_unor_nama,tbl_pegawai.pegawai_nama,tbl_pegawai.pegawai_nip, CONCAT(tbl_jabatan.jabatan_nama, tbl_unor.instansi_unor_nama) as jabatan, count(tbl_pegawai.pegawai_nama) as jumlahasn')
        ->where('tbl_formasi.instansi_unor', $instansi_uker)
        ->where('tbl_formasi.jabatan_kode', $jabatan_kode)
        ->join('tbl_instansi', 'tbl_formasi.instansi_id = tbl_instansi.instansi_id', 'left')
        ->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
        ->join('tbl_unor', 'tbl_unor.instansi_unor = tbl_formasi.instansi_unor', 'left')
        ->join('tbl_pegawai', 'tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode', 'left')
        //->groupBy('jabatan')
        ->where('tbl_pegawai.instansi_unor = tbl_formasi.instansi_unor')
        // ->orderBy('tbl_formasi.jabatan_kode asc')
        ->get();

SELECT *
FROM `tbl_pegawai`
LEFT JOIN `tbl_formasi` ON `tbl_formasi`.`jabatan_kode` = `tbl_pegawai`.`jabatan_kode`
WHERE `tbl_pegawai`.`instansi_unor` = `tbl_formasi`.`instansi_unor`
AND `tbl_pegawai`.`instansi_unor` = 'CB01030000'
AND `tbl_pegawai`.`jabatan_kode` = '3407'
---
function getDetailPegawai($idUnor,$idJabatan)
	{
        $db      = \Config\Database::connect();
		$query =  $db->table('tbl_pegawai')


        ->join('tbl_formasi', 'tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode', 'left')
        ->where('tbl_pegawai.instansi_unor = tbl_formasi.instansi_unor')
        ->where('tbl_pegawai.instansi_unor', $idUnor)
        ->where('tbl_pegawai.jabatan_kode', $idJabatan)
			->get();