app/Controllers/DataFormasi.php

	public function view($idInstansi)
	{
		$data ['title']  = "App-PMB | Data Formasi";
		$data ['page']   = "dataformasi";
		$data ['nama']   = $this->session->get('nama');
		$data ['email']   = $this->session->get('email');

		//Cek Data Fakultas Berdasarkan Id Fakultas
		$cekFakultas = $this->M_instansi->where('instansi_id', $idInstansi)->first();
---
SELECT *
FROM `tbl_instansi`
WHERE `instansi_id` = 'IV'
 LIMIT 1