app/Controllers/Login.php

SELECT *
FROM `tbl_login`
WHERE `username` = 'admin'
 LIMIT 1
---


            //Cek Data username berdasarkan username
             $cekUser = $this->M_user->where('tbl_login.username', $username)->first();