app/Models/FormasiModel.php

	public function getDetailFormasi($idInstansi)
	{
		$query =  $this->db->table('tbl_formasi')
			->where('tbl_formasi.instansi_id', $idInstansi)
			->select('tbl_formasi.instansi_id,tbl_formasi.instansi_unor,tbl_formasi.jabatan_kode,formasi_jumlah,tbl_jabatan.jabatan_nama,tbl_unor.instansi_unor_nama,tbl_pegawai.pegawai_nama,tbl_pegawai.pegawai_nip, CONCAT(tbl_jabatan.jabatan_nama, tbl_unor.instansi_unor_nama) as jabatan, count(tbl_pegawai.pegawai_nama) as jumlahasn')
			->join('tbl_instansi', 'tbl_formasi.instansi_id = tbl_instansi.instansi_id', 'left')
			->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
			->join('tbl_unor', 'tbl_unor.instansi_unor = tbl_formasi.instansi_unor', 'left')
			->join('tbl_pegawai', 'tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode', 'left')
			->groupBy('jabatan')
			->where('tbl_pegawai.instansi_unor = tbl_formasi.instansi_unor')
			->orderBy('tbl_formasi.jabatan_kode asc')
			->get();
---
SELECT `tbl_formasi`.`instansi_id`, `tbl_formasi`.`instansi_unor`, `tbl_formasi`.`jabatan_kode`, `formasi_jumlah`, `tbl_jabatan`.`jabatan_nama`, `tbl_unor`.`instansi_unor_nama`, `tbl_pegawai`.`pegawai_nama`, `tbl_pegawai`.`pegawai_nip`, CONCAT(tbl_jabatan.jabatan_nama, tbl_unor.instansi_unor_nama) as jabatan, count(tbl_pegawai.pegawai_nama) as jumlahasn
FROM `tbl_formasi`
LEFT JOIN `tbl_instansi` ON `tbl_formasi`.`instansi_id` = `tbl_instansi`.`instansi_id`
LEFT JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
LEFT JOIN `tbl_unor` ON `tbl_unor`.`instansi_unor` = `tbl_formasi`.`instansi_unor`
LEFT JOIN `tbl_pegawai` ON `tbl_formasi`.`jabatan_kode` = `tbl_pegawai`.`jabatan_kode`
WHERE `tbl_formasi`.`instansi_id` = 'CB'
AND `tbl_pegawai`.`instansi_unor` = `tbl_formasi`.`instansi_unor`
GROUP BY `jabatan`
ORDER BY `tbl_formasi`.`jabatan_kode` asc

	public function getDetailPegawai($idJabatan,$idUnor)
	{
		$query =  $this->db->table('tbl_formasi')
<<<<<<< HEAD
			->select('tbl_formasi.instansi_id,tbl_formasi.instansi_unor,tbl_formasi.jabatan_kode,formasi_jumlah,tbl_jabatan.jabatan_nama,tbl_unor.instansi_unor_nama,tbl_pegawai.pegawai_nama,tbl_pegawai.pegawai_nip, CONCAT(tbl_jabatan.jabatan_nama, tbl_unor.instansi_unor_nama) as jabatan, count(tbl_pegawai.pegawai_nama) as jumlahasn')
			->where('tbl_formasi.jabatan_kode', $idJabatan)
			->where('tbl_formasi.instansi_unor', $idUnor)
			->join('tbl_instansi', 'tbl_formasi.instansi_id = tbl_instansi.instansi_id', 'left')
=======
			->select('tbl_formasi.instansi_id,tbl_formasi.instansi_unor,tbl_formasi.jabatan_kode,formasi_jumlah,tbl_jabatan.jabatan_nama,tbl_unor.instansi_unor_nama,tbl_pegawai.pegawai_nama')
			->where('tbl_formasi.instansi_id', $idInstansi)
>>>>>>> e934d5183acfe62c401bbdc106026147ba941bca
			->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
			->join('tbl_unor', 'tbl_unor.instansi_unor = tbl_formasi.instansi_unor', 'left')
			->join('tbl_pegawai', 'tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode', 'left')
			->groupBy('jabatan')
			->where('tbl_pegawai.instansi_unor = tbl_formasi.instansi_unor')
			->get();
---
SELECT *, concat(tbl_formasi.jabatan_kode, tbl_formasi.instansi_unor) as jabatan, count(tbl_pegawai.pegawai_nip) as jumlahasn
FROM `tbl_formasi`
LEFT JOIN `tbl_pegawai` ON `tbl_formasi`.`jabatan_kode` = `tbl_pegawai`.`jabatan_kode`
LEFT JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
LEFT JOIN `tbl_unor` ON `tbl_unor`.`instansi_unor` = `tbl_formasi`.`instansi_unor`
WHERE `tbl_formasi`.`instansi_id` = 'CB'
AND `tbl_pegawai`.`instansi_unor` = `tbl_formasi`.`instansi_unor` and `tbl_pegawai`.`jabatan_kode` = `tbl_formasi`.`jabatan_kode`
GROUP BY `tbl_pegawai`.`instansi_unor`
ORDER BY `tbl_formasi`.`formasi_id` asc

	public function getpegawaibyunorandjabatan($instansiunor,$jabatankode)
    {
		// 	// $tes   = $this->db->query('SELECT*FROM tbl_formasi WHERE instansi_unor="'.$instansiunor.'" ');
		// 	$tes   = $this->db->query('SELECT*FROM tbl_formasi
		// 	LEFT JOIN tbl_unor ON tbl_unor.instansi_unor = tbl_formasi.instansi_unor
		// 	LEFT JOIN tbl_pegawai ON tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode
		// 	WHERE tbl_formasi.jabatan_kode='.$jabatankode.'');
		// return $tes;




		$query =  $this->db->table('tbl_formasi')
			->select('tbl_formasi.instansi_id,tbl_formasi.instansi_unor,tbl_formasi.jabatan_kode,formasi_jumlah,tbl_jabatan.jabatan_nama,tbl_unor.instansi_unor_nama,tbl_pegawai.pegawai_nama')
			->where('tbl_formasi.instansi_unor', $instansiunor)
			->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
			->join('tbl_unor', 'tbl_unor.instansi_unor = tbl_formasi.instansi_unor')
			->join('tbl_pegawai', 'tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode')

			// ->groupBy('tbl_pegawai.jabatan_kode', 'tbl_pegawai.instansi_unor')
			->where('tbl_pegawai.jabatan_kode',$jabatankode)
			// ->join('tbl_instansi', 'tbl_formasi.instansi_id = tbl_instansi.instansi_id')
			// ->groupBy('tbl_pegawai.jabatan_kode', 'tbl_pegawai.instansi_unor')
			//
			//
			// ->where('tbl_formasi.instansi_id', $idInstansi)
			->get();
---
SELECT `tbl_formasi`.`instansi_id`, `tbl_formasi`.`instansi_unor`, `tbl_formasi`.`jabatan_kode`, `formasi_jumlah`, `tbl_jabatan`.`jabatan_nama`, `tbl_unor`.`instansi_unor_nama`, `tbl_pegawai`.`pegawai_nama`
FROM `tbl_formasi`
LEFT JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
JOIN `tbl_unor` ON `tbl_unor`.`instansi_unor` = `tbl_formasi`.`instansi_unor`
JOIN `tbl_pegawai` ON `tbl_formasi`.`jabatan_kode` = `tbl_pegawai`.`jabatan_kode`
WHERE `tbl_formasi`.`instansi_unor` = 'CB01030000'
AND `tbl_pegawai`.`jabatan_kode` = '3407'