app/Models/FormasiModel.php

	public function count_all($idInstansi){
	    $tbl_storage = $this->db->table($this->table)->select('*')->where('tbl_formasi.instansi_id', $idInstansi);
	    return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_formasi`
WHERE `tbl_formasi`.`instansi_id` = 'AG'