app/Models/PetugasModel.php

	function get_datatables()
	{
		$this->_get_datatables_query();
		if ($this->request->getPost('length') != -1)
			$this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_petugas`