app/Models/UsulanModel.php

SELECT *
FROM `tbl_usulan`
JOIN `tbl_instansi` ON `tbl_usulan`.`instansi_id` = `tbl_instansi`.`instansi_id`
JOIN `tbl_unor` ON `tbl_usulan`.`instansi_unor` = `tbl_unor`.`instansi_unor`
WHERE `tbl_usulan`.`tahun_usulan` = '2022'
---
	public function getUsulan($yearnow)
    {
        $query =  $this->db->table('tbl_usulan')
         ->join('tbl_instansi', 'tbl_usulan.instansi_id = tbl_instansi.instansi_id')
		 ->join('tbl_unor', 'tbl_usulan.instansi_unor = tbl_unor.instansi_unor')
		 ->where('tbl_usulan.tahun_usulan',$yearnow)
         ->get();

SELECT *
FROM `tbl_usulan`
JOIN `tbl_detail_usulan` ON `tbl_usulan`.`usulan_id` = `tbl_detail_usulan`.`usulan_id`
JOIN `tbl_instansi` ON `tbl_usulan`.`instansi_id` = `tbl_instansi`.`instansi_id`
JOIN `tbl_unor` ON `tbl_usulan`.`instansi_unor` = `tbl_unor`.`instansi_unor`
JOIN `tbl_formasi` ON `tbl_detail_usulan`.`formasi_id` = `tbl_formasi`.`formasi_id`
WHERE `tbl_usulan`.`usulan_id` = '2'
---
	public function getUsulanByID($id)
    {
        $query =  $this->db->table('tbl_usulan')
		->join('tbl_detail_usulan', 'tbl_usulan.usulan_id = tbl_detail_usulan.usulan_id')
         ->join('tbl_instansi', 'tbl_usulan.instansi_id = tbl_instansi.instansi_id')
		 ->join('tbl_unor', 'tbl_usulan.instansi_unor = tbl_unor.instansi_unor')
		 ->join('tbl_formasi', 'tbl_detail_usulan.formasi_id = tbl_formasi.formasi_id')
		 ->where('tbl_usulan.usulan_id',$id)
         ->get();

SELECT *
FROM `tbl_detail_usulan`
JOIN `tbl_usulan` ON `tbl_usulan`.`usulan_id` = `tbl_detail_usulan`.`usulan_id`
JOIN `tbl_jabatan` ON `tbl_detail_usulan`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
JOIN `tbl_instansi` ON `tbl_usulan`.`instansi_id` = `tbl_instansi`.`instansi_id`
JOIN `tbl_unor` ON `tbl_usulan`.`instansi_unor` = `tbl_unor`.`instansi_unor`
WHERE `tbl_detail_usulan`.`usulan_id` = '2'
ORDER BY `tbl_detail_usulan`.`status_usulan` ASC
---
	public function getDetailUsulanByID($id)
    {
        $query =  $this->db->table('tbl_detail_usulan')
		 ->join('tbl_usulan', 'tbl_usulan.usulan_id = tbl_detail_usulan.usulan_id')
		 ->join('tbl_formasi', 'tbl_detail_usulan.formasi_id = tbl_formasi.formasi_id')
		 ->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode')
		 ->where('tbl_detail_usulan.usulan_id',$id)
		 ->orderBy('tbl_detail_usulan.status_usulan', 'ASC')
         ->get();

SELECT *, count(tbl_pegawai.pegawai_nama) as jumlahasn
FROM `tbl_detail_usulan`
JOIN `tbl_usulan` ON `tbl_usulan`.`usulan_id` = `tbl_detail_usulan`.`usulan_id`
JOIN `tbl_formasi` ON `tbl_detail_usulan`.`formasi_id` = `tbl_formasi`.`formasi_id`
JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
JOIN `tbl_pegawai` ON `tbl_pegawai`.`instansi_unor` = `tbl_usulan`.`instansi_unor` and `tbl_pegawai`.`jabatan_kode` = `tbl_formasi`.`jabatan_kode`
WHERE `tbl_detail_usulan`.`usulan_id` = '2'
ORDER BY `tbl_detail_usulan`.`status_usulan` ASC
---
	public function getDetailUsulanByID_2($id)
    {
        $query =  $this->db->table('tbl_detail_usulan')
		 ->join('tbl_usulan', 'tbl_usulan.usulan_id = tbl_detail_usulan.usulan_id')
		 ->join('tbl_jabatan', 'tbl_detail_usulan.jabatan_kode = tbl_jabatan.jabatan_kode')
		 ->join('tbl_instansi', 'tbl_usulan.instansi_id = tbl_instansi.instansi_id')
		 ->join('tbl_unor', 'tbl_usulan.instansi_unor = tbl_unor.instansi_unor')
		 ->where('tbl_detail_usulan.usulan_id',$id)
		 ->orderBy('tbl_detail_usulan.status_usulan', 'ASC')
         ->get();